golf-bag-backend/app/controllers/bags_controller.rb

SELECT "bags".* FROM "bags"
---
  def index
    bags = Bag.all

SELECT "bags".* FROM "bags" WHERE "bags"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    bag = Bag.find(params[:id])

INSERT INTO "bags" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Maddie"], ["created_at", "2020-07-27 12:35:19.528220"], ["updated_at", "2020-07-27 12:35:19.528220"]]
---
  def create
    bag = Bag.new(name: params[:name])

    if bag.save

SELECT "bags".* FROM "bags" WHERE "bags"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "bags" WHERE "bags"."id" = $1  [["id", 5]]
---
  def destroy
    bag = Bag.find(params[:id])
    bag.destroy