golf-bag-backend/app/controllers/clubs_controller.rb

  def index
    clubs = Club.where(bag_id:params[:bag_id])
---
SELECT "clubs".* FROM "clubs" WHERE "clubs"."bag_id" = $1  [["bag_id", 1]]

  def create
    bag = Bag.find(params[:bag_id])
    club = bag.clubs.new(club_params)
    if club.save
---
SELECT "bags".* FROM "bags" WHERE "bags"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "clubs" ("club_type", "loft", "brand", "model", "bag_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["club_type", "Driver"], ["loft", "3"], ["brand", "Titlest"], ["model", "sadfasdfsf"], ["bag_id", 2], ["created_at", "2020-07-27 19:32:23.817933"], ["updated_at", "2020-07-27 19:32:23.817933"]]