golf-bag-backend/app/controllers/clubs_controller.rb

SELECT "clubs".* FROM "clubs"
---
  def index
    clubs = Club.all